000030       05 LS-OPT       PIC X(04).                                 00003000
000040       05 LS-ORD-ID    PIC 9(10).                                 00004001
000500       05 LS-MSG       PIC X(80).                                 00050000
