000010       05 LS-OPT       PIC X(04).                                 00001001
000030       05 LS-ORD-ID    PIC 9(10).                                 00003001
000031       05 LS-CUST-ID   PIC 9(10).                                 00003101
000032       05 LS-EMP-ID    PIC 9(10).                                 00003201
000033       05 LS-PROD-ID   PIC 9(10).                                 00003301
000034       05 LS-UNIT-PRC  PIC X(12).                                 00003402
000035       05 LS-QUANTITY  PIC 9(05).                                 00003501
000036       05 LS-ORD-DATE  PIC X(10).                                 00003601
000037       05 LS-REQ-DATE  PIC X(10).                                 00003701
000038       05 LS-SHP-DATE  PIC X(10).                                 00003801
000039       05 LS-CARR-COST PIC X(12).                                 00003902
000040       05 LS-TOT-COST  PIC X(18).                                 00004002
000041       05 LS-TOKEN     PIC X(01).                                 00004101
000042       05 LS-SCM       PIC X(03).                                 00004201
000043       05 LS-CONFIRM   PIC X(01).                                 00004301
000500       05 LS-MSG       PIC X(80).                                 00050000
