000040       05 LS-STS-ID   PIC X(1).                                   00004002
000500       05 LS-MSG      PIC X(80).                                  00050002
