000010       05 LS1-OPT               PIC X(4).                         00001001
000011       05 LS1-PROD-ID           PIC 9(10).                        00001101
000012       05 LS1-PROD-NAME         PIC X(40).                        00001201
000020*                                                                 00002000
000110          05 LS1-ORD-ID         PIC 9(10).                        00011001
000120          05 LS1-CUST-ID        PIC 9(10).                        00012001
000121          05 LS1-EMP-ID         PIC 9(10).                        00012102
000130          05 LS1-QUANT          PIC 9(05).                        00013001
000140          05 LS1-ORD-DATE       PIC X(10).                        00014001
000150          05 LS1-ORD-TOTAL-COST PIC 9(18).                        00015001
000160*                                                                 00016002
000161          05 LS2-ORD-ID         PIC 9(10).                        00016101
000162          05 LS2-CUST-ID        PIC 9(10).                        00016201
000163          05 LS2-EMP-ID         PIC 9(10).                        00016302
000164          05 LS2-QUANT          PIC 9(05).                        00016402
000165          05 LS2-ORD-DATE       PIC X(10).                        00016502
000166          05 LS2-ORD-TOTAL-COST PIC 9(18).                        00016602
000167*                                                                 00016702
000168          05 LS3-ORD-ID         PIC 9(10).                        00016802
000169          05 LS3-CUST-ID        PIC 9(10).                        00016902
000170          05 LS3-EMP-ID         PIC 9(10).                        00017002
000171          05 LS3-QUANT          PIC 9(05).                        00017102
000172          05 LS3-ORD-DATE       PIC X(10).                        00017202
000173          05 LS3-ORD-TOTAL-COST PIC 9(18).                        00017302
000174*                                                                 00017402
000175          05 LS4-ORD-ID         PIC 9(10).                        00017502
000176          05 LS4-CUST-ID        PIC 9(10).                        00017602
000177          05 LS4-EMP-ID         PIC 9(10).                        00017702
000178          05 LS4-QUANT          PIC 9(05).                        00017802
000179          05 LS4-ORD-DATE       PIC X(10).                        00017902
000180          05 LS4-ORD-TOTAL-COST PIC 9(18).                        00018002
000181*                                                                 00018102
000182          05 LS5-ORD-ID         PIC 9(10).                        00018202
000183          05 LS5-CUST-ID        PIC 9(10).                        00018302
000184          05 LS5-EMP-ID         PIC 9(10).                        00018402
000185          05 LS5-QUANT          PIC 9(05).                        00018502
000186          05 LS5-ORD-DATE       PIC X(10).                        00018602
000187          05 LS5-ORD-TOTAL-COST PIC 9(18).                        00018702
000188*                                                                 00018802
000189          05 LS6-ORD-ID         PIC 9(10).                        00018902
000190          05 LS6-CUST-ID        PIC 9(10).                        00019002
000191          05 LS6-EMP-ID         PIC 9(10).                        00019102
000192          05 LS6-QUANT          PIC 9(05).                        00019202
000193          05 LS6-ORD-DATE       PIC X(10).                        00019302
000194          05 LS6-ORD-TOTAL-COST PIC 9(18).                        00019402
000195*                                                                 00019502
000196          05 LS7-ORD-ID         PIC 9(10).                        00019602
000197          05 LS7-CUST-ID        PIC 9(10).                        00019702
000198          05 LS7-EMP-ID         PIC 9(10).                        00019802
000199          05 LS7-QUANT          PIC 9(05).                        00019902
000200          05 LS7-ORD-DATE       PIC X(10).                        00020002
000201          05 LS7-ORD-TOTAL-COST PIC 9(18).                        00020102
000202*                                                                 00020202
000203          05 LS8-ORD-ID         PIC 9(10).                        00020302
000204          05 LS8-CUST-ID        PIC 9(10).                        00020402
000205          05 LS8-EMP-ID         PIC 9(10).                        00020502
000206          05 LS8-QUANT          PIC 9(05).                        00020602
000207          05 LS8-ORD-DATE       PIC X(10).                        00020702
000208          05 LS8-ORD-TOTAL-COST PIC 9(18).                        00020802
000209*                                                                 00020902
000500       05 LS1-MSG         PIC X(100).                             00050001
