000010     05 LS-OPT        PIC      X(6).                              00001000
000020     05 LS-CURSOR-POS PIC      9(1).                              00002000
000100     05 LS-PRODID     PIC      9(10).                             00010000
000200     05 LS-PRODNM     PIC      X(40).                             00020000
000300     05 LS-SUPID      PIC      X(5).                              00030000
000400     05 LS-CATID      PIC      X(5).                              00040000
000500     05 LS-CATNM      PIC      X(40).                             00050000
000600     05 LS-UNIPRC     PIC      X(12).                             00060001
000700     05 LS-UNISTK     PIC      9(5).                              00070000
000800     05 LS-UNIORD     PIC      9(5).                              00080000
000900     05 LS-MSG        PIC      X(70).                             00090000
