000010       05 LS-OPT      PIC X(4).                                   00001002
000020*                                                                 00002000
000030       05 LS-ORD-ID   PIC 9(10).                                  00003001
000031       05 LS-DLR-ID   PIC 9(10).                                  00003102
000032       05 LS-PROD-ID  PIC 9(10).                                  00003202
000033       05 LS-PROD-QNT PIC 9(05).                                  00003302
000040       05 LS-STS-ID   PIC X(1).                                   00004002
000500       05 LS-MSG      PIC X(80).                                  00050002
