//UADT014A JOB NOTIFY=&SYSUID,MSGLEVEL=(1,1)                            JOB08197
//BLDINDEX EXEC PGM=IDCAMS
//SYSPRINT DD   SYSOUT=*
//BASEDD   DD   DSN=ELTP.BLR.OMA,DISP=OLD
//AIXDD    DD   DSN=ELTP.BLR.OMA.AIX,DISP=OLD
//IDCUT1   DD   UNIT=SYSDA,SPACE=(CYL,20)
//IDCUT2   DD   UNIT=SYSDA,SPACE=(CYL,20)
//SYSIN    DD   *
 BLDINDEX  INFILE (BASEDD)                    -
           OUTFILE (AIXDD)
/*
