//UADT014A JOB NOTIFY=&SYSUID,MSGLEVEL=(1,1)                            JOB08075
//COPYVSAM EXEC PGM=IDCAMS
//*NDD1    DD  DSN=ELTP.BCASE.OMA,DISP=SHR
//*UTDD1   DD  DSN=ELTP.BLR.OMA,DISP=SHR
//SYSPRINT DD  SYSOUT=*
//SYSIN    DD  *
  REPRO    INDATASET(ELTP.BCASE.OMA)   -
           OUTDATASET(ELTP.BLR.OMA)
/*
