          05 LK-EMP-ID        PIC 9(10).                                00010025
          05 LK-EMP-NAME      PIC X(40).                                00020026
          05 LK-MSG           PIC X(65).                                00030013
          05 LK-FLAG          PIC X(4).                                 00070213
          05 LK-COUNT         PIC 9(05).                                00070626
       02    ORDLISTGROUP.                                              00071013
        03    LK-OUTPUT-REC-ARRAY   OCCURS 08 TIMES INDEXED BY K.       00072022
          05 OUT-ORD-CUST-ID     PIC ZZZZZ99999.                        00090030
          05 OUT-ORD-PROD-ID     PIC ZZZZZ99999.                        00110030
          05 OUT-ORD-QUANT       PIC ZZZ99.                             00130030
          05 OUT-ORD-ID          PIC ZZZZZ99999.                        00150030
          05 OUT-ORD-DATE        PIC X(10).                             00170023
          05 OUT-ORD-TOTAL-COST  PIC ZZZZZZZZZZZZZZ9999.                00190029
