                05  LS-OPT            PIC X(6).                         00010000
                05  LS-PROD-ID        PIC 9(10).                        00040000
                05  LS-MSG1           PIC X(80).                        00050001
