       01 LINE1         PIC X(80).                                      00010000
       01 LINE2         PIC X(80).                                      00020000
       01 LINE3         PIC X(80).                                      00030000
       01 LINE4         PIC X(80).                                      00040000
       01 LINE5         PIC X(80).                                      00050000
       01 LINE6         PIC X(80).                                      00060000
       01 LINE7         PIC X(80).                                      00070000
       01 LINE8         PIC X(80).                                      00080000
       01 LINE9         PIC X(80).                                      00090000
       01 LINE10        PIC X(80).                                      00100000
       01 LINE11        PIC X(80).                                      00110000
       01 LINE12        PIC X(80).                                      00120000
       01 LINE13        PIC X(80).                                      00130000
       01 LINE14        PIC X(80).                                      00140000
       01 LINE15        PIC X(80).                                      00150000
       01 LINE16        PIC X(80).                                      00160000
       01 LINE17        PIC X(80).                                      00170000
       01 LINE18        PIC X(80).                                      00180000
