000020*                                                                 00002000
000040       05 LS-ORD-ID    PIC 9(10).                                 00004000
000050*                                                                 00005000
000110          05 LS-CUSTID    PIC 9(10).                              00011000
000120          05 LS-CUST-NAME PIC X(40).                              00012000
000130          05 LS-ORDID     PIC 9(10).                              00013000
000140          05 LS-PROD-ID   PIC 9(10).                              00014000
000150          05 LS-PROD-NAME PIC X(40).                              00015000
000160          05 LS-QNTY      PIC 9(5).                               00016000
000170          05 LS-ORD-DATE  PIC X(10).                              00017000
000180          05 LS-STATUS    PIC X(1).                               00018000
000190*                                                                 00019000
000500       05 LS-MSG          PIC X(80).                              00050000
