000010       05 LS-OPT       PIC X(4).                                  00001000
000020*                                                                 00002000
000030       05 LS-CUST-ID   PIC 9(10).                                 00003000
000040       05 LS-ORD-ID    PIC 9(10).                                 00004000
000050*                                                                 00005000
000110          05 LS1-CUSTID    PIC 9(10).                             00011000
000120          05 LS1-CUST-NAME PIC X(40).                             00012000
000130          05 LS1-ORDID     PIC 9(10).                             00013000
000140          05 LS1-PROD-ID   PIC 9(10).                             00014000
000150          05 LS1-PROD-NAME PIC X(40).                             00015000
000160          05 LS1-QNTY      PIC 9(5).                              00016000
000170          05 LS1-ORD-DATE  PIC X(10).                             00017000
000180          05 LS1-STATUS    PIC X(1).                              00018000
000190*                                                                 00019000
000050*                                                                 00020001
000110          05 LS2-CUSTID    PIC 9(10).                             00030001
000120          05 LS2-CUST-NAME PIC X(40).                             00040001
000130          05 LS2-ORDID     PIC 9(10).                             00041001
000140          05 LS2-PROD-ID   PIC 9(10).                             00042001
000150          05 LS2-PROD-NAME PIC X(40).                             00043001
000160          05 LS2-QNTY      PIC 9(5).                              00044001
000170          05 LS2-ORD-DATE  PIC X(10).                             00045001
000180          05 LS2-STATUS    PIC X(1).                              00046001
000190*                                                                 00047001
000110          05 LS3-CUSTID    PIC 9(10).                             00048001
000120          05 LS3-CUST-NAME PIC X(40).                             00049001
000130          05 LS3-ORDID     PIC 9(10).                             00049101
000140          05 LS3-PROD-ID   PIC 9(10).                             00049201
000150          05 LS3-PROD-NAME PIC X(40).                             00049301
000160          05 LS3-QNTY      PIC 9(5).                              00049401
000170          05 LS3-ORD-DATE  PIC X(10).                             00049501
000180          05 LS3-STATUS    PIC X(1).                              00049601
000190*                                                                 00049701
000110          05 LS4-CUSTID    PIC 9(10).                             00049801
000120          05 LS4-CUST-NAME PIC X(40).                             00049901
000130          05 LS4-ORDID     PIC 9(10).                             00050001
000140          05 LS4-PROD-ID   PIC 9(10).                             00051001
000150          05 LS4-PROD-NAME PIC X(40).                             00052001
000160          05 LS4-QNTY      PIC 9(5).                              00053001
000170          05 LS4-ORD-DATE  PIC X(10).                             00054001
000180          05 LS4-STATUS    PIC X(1).                              00055001
000190*                                                                 00056001
000110          05 LS5-CUSTID    PIC 9(10).                             00057001
000120          05 LS5-CUST-NAME PIC X(40).                             00058001
000130          05 LS5-ORDID     PIC 9(10).                             00059001
000140          05 LS5-PROD-ID   PIC 9(10).                             00059101
000150          05 LS5-PROD-NAME PIC X(40).                             00059201
000160          05 LS5-QNTY      PIC 9(5).                              00059301
000170          05 LS5-ORD-DATE  PIC X(10).                             00059401
000180          05 LS5-STATUS    PIC X(1).                              00059501
000190*                                                                 00059601
000110          05 LS6-CUSTID    PIC 9(10).                             00059701
000120          05 LS6-CUST-NAME PIC X(40).                             00059801
000130          05 LS6-ORDID     PIC 9(10).                             00059901
000140          05 LS6-PROD-ID   PIC 9(10).                             00060001
000150          05 LS6-PROD-NAME PIC X(40).                             00061001
000160          05 LS6-QNTY      PIC 9(5).                              00062001
000170          05 LS6-ORD-DATE  PIC X(10).                             00063001
000180          05 LS6-STATUS    PIC X(1).                              00064001
000190*                                                                 00064101
000110          05 LS7-CUSTID    PIC 9(10).                             00064201
000120          05 LS7-CUST-NAME PIC X(40).                             00064301
000130          05 LS7-ORDID     PIC 9(10).                             00064401
000140          05 LS7-PROD-ID   PIC 9(10).                             00064501
000150          05 LS7-PROD-NAME PIC X(40).                             00064601
000160          05 LS7-QNTY      PIC 9(5).                              00064701
000170          05 LS7-ORD-DATE  PIC X(10).                             00064801
000180          05 LS7-STATUS    PIC X(1).                              00064901
000190*                                                                 00065001
000110          05 LS8-CUSTID    PIC 9(10).                             00066001
000120          05 LS8-CUST-NAME PIC X(40).                             00067001
000130          05 LS8-ORDID     PIC 9(10).                             00068001
000140          05 LS8-PROD-ID   PIC 9(10).                             00069001
000150          05 LS8-PROD-NAME PIC X(40).                             00069101
000160          05 LS8-QNTY      PIC 9(5).                              00069201
000170          05 LS8-ORD-DATE  PIC X(10).                             00069301
000180          05 LS8-STATUS    PIC X(1).                              00069401
000190*                                                                 00069501
000500       05 LS-MSG          PIC X(80).                              00070001
