//UADT014J JOB 'IEBGENER UTILITY',NOTIFY=&SYSUID
//STEP1 EXEC PGM=IEBGENER
//SYSIN DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSUT1 DD DISP=SHR,DSN=UADT014.XML.INPUT
//SYSUT2 DD DISP=(NEW,CATLG),DSN=UADT014.TEMP2,
//*            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=80),
//             SPACE=(TRK,(2,3))
