//UADT014J JOB 'IEHLIST UTILITY',NOTIFY=&SYSUID
//STEP1      EXEC PGM=IEHLIST
//SYSPRINT   DD   SYSOUT=*
//ANYDD1     DD   UNIT=SYSDA,VOL=SER=ASAT29,DISP=SHR
//SYSIN      DD   *
  LISTPDS DSNAME=UADT014.BLR.ASM,VOL=SYSDA=ASAT29
/*
