//UADT014Y JOB 'PRNTJOB',NOTIFY=&SYSUID,REGION=0M
//STEP1 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//INDD  DD DSN=IMS910.UTILIDB.DATA,DISP=SHR
//SYSIN DD *
        PRINT -
        INFILE(INDD) -
        CHARACTER
/*
