//UADT014J JOB 'RESTART',NOTIFY=&SYSUID,RESTART=STEP2                   JOB01048
//JOBLIB DD DSN=UADT014.PROCLIB,DISP=SHR                                00020000
//       DD DSN=UADT014.BASE.LOADLIB,DISP=SHR                           00030000
//STEP1 EXEC PGM=TEST1                                                  00040001
//STEPLIB DD DSN=UADT014.JCLLIB,DISP=SHR                                00050000
//STEP2 EXEC PGM=TEST2,PARM='NUTTY'                                     00070001
//*                                                                     00080000
