//UADT014D JOB NOTIFY=&SYSUID                                           JOB03468
//*
//RUNSTATS EXEC DSNUPROC,SYSTEM=DB2A,
//             LIB='DSN810.SDSNLOAD',
//             UID='UADT014'
//DSNUPROC.SYSIN  DD  *
RUNSTATS TABLESPACE RADHIK.PROJECT
INDEX(ALL)
SHRLEVEL CHANGE
/*
