//UADT016C JOB 'C COMPILE',NOTIFY=&SYSUID,REGION=0M                     00010000
//PROCLIB JCLLIB ORDER=UADT016.TESTJCLS.GROUP                           00011001
//STEP1 EXEC PROC=DFHYXTDL,                                             00020000
//           INLIB='UADT016.TESTJCLS.GROUP',                            00030000
//           MEM=CPROG                                                  00040000
//LKED.SYSIN DD *                                                       00050000
  NAME CPROG(R)                                                         00060000
/*                                                                      00070000
