//UADT016I JOB 'IEBGENER OUT FIELDS',NOTIFY=&SYSUID
//STEP1 EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=*
//SYSUT1 DD DSN=UADT016.TEST.DATA,DISP=SHR
//***** PRINTING THE OUTPUT IN THE SPOOL******************************
//SYSUT2 DD SYSOUT=*
//SYSIN DD *
GENERATE MAXFLDS=99
RECORD FIELD=(10,1,,10,11)
       FIELD=(10,11,,10,1)
/*
//
