//UADT016I JOB 'IEBGENER CONCAT',NOTIFY=&SYSUID
//STEP1 EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=*
//SYSUT1 DD DSN=UADT016.TEST.INPUT,DISP=SHR
//       DD DSN=UADT016.TEST.DATA,DISP=SHR
//***** PRINTING THE OUTPUT IN THE SPOOL******************************
//SYSUT2 DD SYSOUT=*
//SYSIN DD DUMMY
//
