//UADT016J JOB 'IEHLIST UTILITY',NOTIFY=&SYSUID                         JOB05925
//STEP1      EXEC PGM=IEHLIST
//SYSPRINT   DD   SYSOUT=*
//ANYDD1     DD   UNIT=SYSDA,VOL=SER=ASAT73,DISP=SHR
//SYSIN      DD   *
  LISTPDS DSNAME=UADT016.ASSMBLR,VOL=SYSDA=ASAT73
/*
