//UADT016Y JOB 'PRNTJOB',NOTIFY=&SYSUID,REGION=0M                       JOB09133
//STEP1 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//INDD  DD DSN=ELTP.BLR.SAMP.BASE,DISP=SHR
//SYSIN DD *
        PRINT -
        INFILE(INDD) -
        CHARACTER
/*
